//
//  Error.strings
//  TheBox iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Usuario o contraseña incorrectos";
"_cancelled_by_user"                    = "Transferencia cancelada";
"_error_folder_destiny_is_the_same_"    = "No se puede mover la carpeta sobre sí misma";
"_error_not_permission_"                = "No tiene permiso para completar la operación";
"_error_path_"                          = "No se puede abrir este archivo o carpeta. Por favor, asegúrese de si existe";
"_file_upload_not_exitst_"              = "El archivo que se quiere subir no existe";
"_forbidden_characters_from_server_"    = "El nombre contiene al menos un carácter inválido";
"_not_connected_internet_"              = "Error de conexión al servidor";
"_not_possible_connect_to_server_"      = "No es posible conectarse al servidor en este momento";
"_not_possible_create_folder_"          = "No se ha podido crear la carpeta";
"_server_down_"                         = "No se puede alcanzar el servidor";
"_time_out_"                            = "Tiempo agotado, inténtelo de nuevo";
"_unknow_response_server_"              = "Respuesta inesperada del servidor";
"_user_autentication_required_"         = "Se requiere autenticación de usuario";
"_file_directory_locked_"               = "Archivo o directorio bloqueado";
"_ssl_certificate_untrusted_"           = "El certificado para este servidor es inválido";
"_internal_server_"                     = "Error interno del servidor";

"_file_already_exists_"                 = "No se puede completar la operación, hay un archivo con el mismo nombre";
"_file_folder_not_exists_"              = "El archivo origen no se encontró en la ruta especificada";
"_folder_contents_nochanged_"           = "Los contenidos de la carpeta no han cambiado";
"_images_invalid_converted_"            = "La imagen es inválida y no se puede convertir en una previsualización";
"_method_not_expected_"                 = "Método de petición inesperado";
"_reauthenticate_user_"                 = "Acceso expirado, por favor vuelva a autenticar el usuario";
"_server_error_retry_"                  = "El servidor no se encuentra disponible temporalmente";
"_too_many_files_"                      = "Demasiados archivos se verían involucrados en esta operación para que se complete con éxito";
"_too_many_request_"                    = "Límite de tasa alcanzado, se han enviado demasiadas peticiones";
"_user_over_quota_"                     = "Se ha completado la cuota de almacenamiento";

"_ssl_connection_error_"                = "Error de la conexión SSL, vuelva a intentarlo";
